---
kind: enumMember
id: F:Autodesk.Revit.DB.CompoundStructureError.DeckCantBoundAbove
enum: Autodesk.Revit.DB.CompoundStructureError
source: html/8e8457e0-84c4-ccb1-114c-fa25a6d37fed.htm
---
# Autodesk.Revit.DB.CompoundStructureError.DeckCantBoundAbove

There is no layer above Structural deck or it is too thin.